In [39]:
# How do you create a DataFrame from a list and a dictionary? Provide an example.
import pandas as pd
lst = [1,2,3,4,5]
df = pd.DataFrame(lst, columns=['Numbers'])
df # using list

   Numbers
0        1
1        2
2        3
3        4
4        5

In [40]:
profile = {
    "name":["virat","rohit","ajay", "karan","vijay","himanshu"],
    'age':[35,45,65,75,65,45]
}
profile_df = pd.DataFrame(profile)
profile_df # creating datarame using dictionary

       name  age
0     virat   35
1     rohit   45
2      ajay   65
3     karan   75
4     vijay   65
5  himanshu   45

#### Finding Second highest salary or age from dataframe

In [42]:
unique_salary = profile_df['age'].drop_duplicates()
unique_salary

0    35
1    45
2    65
3    75
Name: age, dtype: int64

In [43]:
n_largest = unique_salary.nlargest(2)
n_largest

3    75
2    65
Name: age, dtype: int64

In [44]:
second_largest = n_largest.iloc[-1]
second_largest

np.int64(65)

In [45]:
# or in a single line

second_largest = profile_df['age'].drop_duplicates().nlargest(2).iloc[-1]
print(second_largest)

65

What are the key differences between Series and DataFrame?

Feature	    Series	                DataFrame
Structure	One-dimensional	        Two-dimensional
Data Type	Homogeneous	            Heterogeneous
Indexing	Single index	        Rows and columns
Example	    pd.Series([1, 2, 3])	pd.DataFrame({"A": [1, 2]})

 Explain the difference between loc[] and iloc[].
Attribute	loc[]	                    iloc[]
Indexing	Label-based	                Integer-based
Slicing	    Inclusive of both bounds	Exclusive of upper bound
Example	    df.loc[2:4, 'col1']	        df.iloc[2:4, 0]

In [46]:
# How do you handle missing data in a DataFrame?

df = pd.DataFrame({
    'A': [1, None, 3],
    'B': [None, 5, 6]
})

# Drop rows with missing values
df_dropped = df.dropna()
print("After dropping missing rows:\n", df_dropped)

# Fill missing values with a specific value
df_filled = df.fillna(0)
print("\nAfter filling missing values:\n", df_filled)

# Fill missing values with the column mean
df_mean_filled = df.fillna(df.mean())
print("\nAfter filling with column mean:\n", df_mean_filled)

After dropping missing rows:
      A    B
2  3.0  6.0

After filling missing values:
      A    B
0  1.0  0.0
1  0.0  5.0
2  3.0  6.0

After filling with column mean:
      A    B
0  1.0  5.5
1  2.0  5.0
2  3.0  6.0

## Data Manipulation Questions

In [48]:
# How would you filter rows in a DataFrame based on column values?
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
})

# Filter rows where Age > 30
filtered_df = df[df['Age'] > 30]
print(filtered_df)

      Name  Age
2  Charlie   35

In [49]:
#  What is the difference between apply(), map(), and applymap() functions in Pandas?
# Function	    Scope	            Usage
# apply()	    Column/Row	    Apply function to rows/columns
# map()	        Series	        Element-wise mapping
# applymap()	DataFrame	    Element-wise mapping for DataFrame

# Example for apply
df['Age_squared'] = df['Age'].apply(lambda x: x ** 2)
print(df)

# Example for map
df['Name_upper'] = df['Name'].map(str.upper)
print(df)

# Example for applymap
df_numeric = df[['Age']]
print(df_numeric.applymap(lambda x: x * 2))

      Name  Age  Age_squared
0    Alice   25          625
1      Bob   30          900
2  Charlie   35         1225
      Name  Age  Age_squared Name_upper
0    Alice   25          625      ALICE
1      Bob   30          900        BOB
2  Charlie   35         1225    CHARLIE
   Age
0   50
1   60
2   70

C:\Users\HIMANSHU SURYAVANSHI\AppData\Local\Temp\ipykernel_12476\1660026600.py:17: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  print(df_numeric.applymap(lambda x: x * 2))

In [50]:
# . How do you add a new column to a DataFrame based on a condition?
df['Age_group'] = df['Age'].apply(lambda x: 'Adult' if x>=30 else 'Youg')
df

      Name  Age  Age_squared Name_upper Age_group
0    Alice   25          625      ALICE      Youg
1      Bob   30          900        BOB     Adult
2  Charlie   35         1225    CHARLIE     Adult

In [55]:
 # Explain how to merge, join, and concatenate DataFrames. Provide examples.
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [30, 35, 40]})

df_merged = pd.merge(
    df1, df2,
    on='ID',
    how='left'
)
df_merged

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  30.0
2   3  Charlie  35.0

In [56]:
concat_df = pd.concat(
    [df1,df2],
    axis=0,
    ignore_index=True
)
concat_df

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie   NaN
3   2      NaN  30.0
4   3      NaN  35.0
5   4      NaN  40.0

In [58]:
merged_df = filtered_df.merge(
            ref_df,
            left_on=['BELNR', 'BUZEI'],
            right_on=['LFBNR', 'LFPOS'],
            how='inner'
        ) # this syntax when we have to merge on different columns

NameError: name 'ref_df' is not defined

In [80]:
 # 1.How do you use groupby() in Pandas? Provide an example.
import pandas as pd

# Sample data
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'jiva'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'Sales', 'Data Sciene'],
    'Salary': [50000, 60000, 55000, 65000, 70000, 65000]
})
df

      Name   Department  Salary
0    Alice           HR   50000
1      Bob           IT   60000
2  Charlie           HR   55000
3    David           IT   65000
4      Eva        Sales   70000
5     jiva  Data Sciene   65000

In [81]:
df_grouped = df.groupby('Department')['Salary'].sum().reset_index()
df_grouped

    Department  Salary
0  Data Sciene   65000
1           HR  105000
2           IT  125000
3        Sales   70000

In [82]:
# 2.group by with multiple aggregations
df_grouped = df.groupby('Department').agg({'Salary':['mean','sum']}).reset_index()
df_grouped

    Department   Salary
                   mean     sum
0  Data Sciene  65000.0   65000
1           HR  52500.0  105000
2           IT  62500.0  125000
3        Sales  70000.0   70000

In [84]:
# 3.How do you filter groups using filter() (like SQL HAVING)?
df_grouped = df.groupby('Department').filter(lambda x: x['Salary'].sum()>70000)
df_grouped

      Name Department  Salary
0    Alice         HR   50000
1      Bob         IT   60000
2  Charlie         HR   55000
3    David         IT   65000

In [85]:
# 4. How do you use order by (sorting) in Pandas?
sorted_df = df.sort_values(by='Salary', ascending=False)
sorted_df

      Name   Department  Salary
4      Eva        Sales   70000
3    David           IT   65000
5     jiva  Data Sciene   65000
1      Bob           IT   60000
2  Charlie           HR   55000
0    Alice           HR   50000

In [86]:
# 5. How do you create a pivot table in Pandas?
pivot_table = df.pivot_table(
    values='Salary',
    index='Department',
    aggfunc='sum'
)
pivot_table

             Salary
Department
Data Sciene   65000
HR           105000
IT           125000
Sales         70000

In [90]:
# 6. How do you use where conditions in Pandas (SQL-like filtering)?
filtered_df = df[(df['Department']=='IT') & (df["Salary"]>6000)]
filtered_df

    Name Department  Salary
1    Bob         IT   60000
3  David         IT   65000

In [91]:
# 7. How do you use .transform() in groupby() to broadcast group-wise calculations?
df['Average_salry_by_Dept'] = df.groupby('Department')['Salary'].transform('mean')
df

      Name   Department  Salary  Average_salry_by_Dept
0    Alice           HR   50000                52500.0
1      Bob           IT   60000                62500.0
2  Charlie           HR   55000                52500.0
3    David           IT   65000                62500.0
4      Eva        Sales   70000                70000.0
5     jiva  Data Sciene   65000                65000.0